const E = `
ЗАПРЕЩЕНО ИСПОЛЬЗОВАНИЕ ВОЗДУШНОГО ПРОСТРАНСТВА:

1 ОКРУЖНОСТЬ РАДИУС 5КМ ЦЕНТР 543500С0313400В ПОВЕРХНОСТЬ-1200М СР.УР.МОРЯ.

2. ПОЛОСА ШИРИНОЙ ПО 2.5КМ В ОБЕ СТОРОНЫ ОТ ОСИ МАРШРУТА 543500С0313400В-544800С0313200В-545600С0314400В-552000С0312300В. 450М СР.УР.МОРЯ-1200М СР.УР.МОРЯ.
`

const r = E.match(/^\s{0,10}\d{1,2}[.| ]+([^\d].*)/gm);
const header = r.reduce((res, item) => {
    return res.replace(item, '');
}, E);

const c = /.*ОКРУЖ.* (\d{1,3}\.?\d{0,2})КМ .* (\d{4,6}[СC]\d{5,7}[В])/.test(E);
console.log(r, header);